app/controllers/articles_controller.rb

  def create
    article_params = params.require(:article).permit(:title, :content, :city_id, :street, :state, :country)
    @article = current_user.articles.create(article_params)
---
INSERT INTO "articles" ("title", "content", "city", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "sss"], ["content", "sss"], ["city", "sss"], ["user_id", 10], ["created_at", "2015-09-29 03:22:31.315128"], ["updated_at", "2015-09-29 03:22:31.315128"]]

  def show
    @article = Article.find_by({id: params[:id]})
    @author = User.find(@article.user_id).first_name
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]