app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    user_params = params.require(:user).permit(:first_name, :last_name, :email, :password, :city, :avatar)
    @user = User.new(user_params)
    @user.full_name = @user.first_name + ' ' + @user.last_name
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @user = User.friendly.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "city" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["city", "Boston!"], ["updated_at", "2015-09-29 03:17:08.222578"], ["id", 2]]
---
  def update
    user_params = params.require(:user).permit(:first_name, :last_name, :email, :password, :city)
    @user = User.friendly.find(params[:id])
    a = params[:user]
    a[:full_name] = a[:first_name] + " " + a[:last_name]
      if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @user = User.friendly.find(params[:id])